Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkCanNotDeterminCriticalPath Property
 The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkCanNotDeterminCriticalPath { get; }
Public Shared ReadOnly Property NetworkCanNotDeterminCriticalPath As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkCanNotDeterminCriticalPath {
	FailureDefinitionId^ get ();
}
static member NetworkCanNotDeterminCriticalPath : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace